In [1]:
import pandas as pd
from sqlalchemy import create_engine
import re

In [2]:
sqlitedb_path = '../data/raw/veronicamg.db'

In [3]:
engine = create_engine(f'sqlite:///{sqlitedb_path}')

In [4]:
engine.table_names()

['business_info', 'personal_info', 'rank_info']

In [5]:
df_business_info = pd.read_sql_query("select * from business_info", engine)

df_business_info.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5

In [6]:
df_business_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 7 columns):
id                  2208 non-null int64
Unnamed: 0          2208 non-null int64
Source              2208 non-null object
worth               2208 non-null object
worthChange         2208 non-null object
realTimeWorth       0 non-null object
realTimePosition    2208 non-null int64
dtypes: int64(3), object(4)
memory usage: 120.9+ KB

In [7]:
df_business_info.isnull().sum()

id                     0
Unnamed: 0             0
Source                 0
worth                  0
worthChange            0
realTimeWorth       2208
realTimePosition       0
dtype: int64

In [8]:
df_business_info_2 = df_business_info[['id','Unnamed: 0','Source','worth','worthChange','realTimePosition']]

In [9]:
df_personal_info = pd.read_sql_query("select * from personal_info", engine)

df_personal_info.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,1014,bEZOs,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,1305,gaTEs,62 years old,53,Male,USA,https://specials-images.forbesimg.com/imageser...
2,3988,bufFETt,87 years old,54,M,United States,https://specials-images.forbesimg.com/imageser...
3,9380,aRNAUlt,69 years old,55,None,None,https://specials-images.forbesimg.com/imageser...
4,4001,zucKERBERg,1985,56,M,United States,https://specials-images.forbesimg.com/imageser...

In [10]:
df_personal_info.isnull().sum()

id             0
lastName       0
age           65
Unnamed: 0     0
gender        13
country        0
image          0
dtype: int64

In [11]:
df_rank_info = pd.read_sql_query("select * from rank_info", engine)

df_rank_info.head()

     id                         name  position  Unnamed: 0
0  9036  anant ASAVABHOKHIN & FAMILY       NaN           0
1  4048               aRASH FERdowsi       NaN           1
2  7384     banthoon LAMSAM & FAMILy       NaN           2
3  9738       bill adDERLEY & family       NaN           3
4  5623            boris zINGARevich       NaN           4

In [12]:
df_business_personal = pd.merge(df_business_info_2, df_personal_info, on='Unnamed: 0')
df_business_personal.head()

,id_x,Unnamed: 0,Source,worth,worthChange,realTimePosition,id_y,lastName,age,gender,country,image
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,1014,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,1305,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,3988,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,9380,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,4001,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...

In [13]:
df_merged = pd.merge(df_business_personal, df_rank_info, on='Unnamed: 0')
df_merged.head()

,id_x,Unnamed: 0,Source,worth,worthChange,realTimePosition,id_y,lastName,age,gender,country,image,id,name,position
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,1014,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...,1014,JEFF BEZOs,1.0
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,1305,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...,1305,bilL GAtes,2.0
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,3988,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...,3988,wARREN BUFFett,3.0
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,9380,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...,9380,bERNARD ARnault,4.0
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,4001,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...,4001,mark zUCKERBERG,5.0

In [14]:
df_merged.drop(columns=['id_x', 'id_y'], inplace = True)

In [15]:
null_cols = df_merged.isnull().sum()

null_cols[null_cols > 0]

null_cols[null_cols > 0] / len(df_merged) * 100

age       2.943841
gender    0.588768
dtype: float64

In [16]:
#As the percentage of null values is quite low I am not going to transform the null values.

"""SOURCE COLUMN --> I'm going to split the 'Source' column in two columns:
- Comnpany Sector
- Company Name"""

In [17]:
df_merged_source = df_merged['Source'].apply(lambda x : x.split('  ==> '))
company_name_list = [x[1:] for x in df_merged_source]
company_sector_list = [x[:1] for x in df_merged_source]
df_merged['Company Sector'] = company_sector_list
df_merged['Company Name'] = company_name_list
df_merged_companysector = df_merged['Company Sector'].apply(lambda x : x[0])
df_merged_companyname = df_merged['Company Name'].apply(lambda x : x[0])
df_merged['Company Sector'] = df_merged_companysector
df_merged['Company Name'] = df_merged_companyname
df_merged.drop(columns = ['Source'], inplace = True)

"""WORTH COLUMN --> I'm going to change the type of the worth column from object type to float type"""

In [18]:
#First let's see if all quantities are expressed in the same unit of measure and in the same currency.
df_merged_worth = df_merged['worth'].apply(lambda x : x.split(' '))
worth_unit = [x[1:] for x in df_merged_worth]
df_merged['worth_unit'] = worth_unit
df_merged_worthunit = df_merged['worth_unit'].apply(lambda x : x[0])
df_merged['worth_unit'] = df_merged_worthunit
df_merged.worth_unit.unique()

array(['BUSD'], dtype=object)

In [19]:
"""Now that we know that all the amounts are in the same unit and in the same currency, 
let's change the type of values in the column."""
worth_amount = [x[:1] for x in df_merged_worth]
df_merged["worth_amount (BUSD)"] = worth_amount
df_merged_worthamount = df_merged["worth_amount (BUSD)"].apply(lambda x : x[0])
df_merged["worth_amount (BUSD)"] = df_merged_worthamount
df_merged["worth_amount (BUSD)"] = df_merged["worth_amount (BUSD)"].astype(float)
df_merged.drop(columns = ['worth_unit','worth'], inplace = True)

"""AGE COLUMN --> I'm going to change the type of the age column from object type to float type. 
For that I will do the following:
- Check if the format is the same in all records.
- Standardize the format of all the records (in the case that it is not the same in all).
- Change the type of data from object to int."""

In [20]:
#Let's see if the format is the same in all records.
df_merged.age.unique()

array(['54 years old', '62 years old', '87 years old', '69 years old',
       '1985', '82 years old', '78 years old', '73 years old',
       '76 years old', '45 years old', '44 years old', '70 years old',
       '68 years old', '46 years old', '64 years old', '61 years old',
       '53 years old', '84 years old', '90 years old', '59 years old',
       '63 years old', '66 years old', '80 years old', '81 years old',
       '56 years old', '79 years old', '74 years old', '60 years old',
       '93 years old', '52 years old', '1983', '65 years old',
       '83 years old', '67 years old', '75 years old', '89 years old',
       None, '72 years old', '48 years old', '77 years old',
       '86 years old', '57 years old', '1988', '55 years old',
       '94 years old', '47 years old', '71 years old', '92 years old',
       '88 years old', '85 years old', '49 years old', '51 years old',
       '50 years old', '43 years old', '42 years old', '91 years old',
       '58 years old', '1984', '38 years old', '1982', '95 years old',
       '39 years old', '41 years old', '40 years old', '1990', '1991',
       '97 years old', '1986', '99 years old', '1994', '1998', '1996',
       '96 years old', '1987', '1989', '1992'], dtype=object)

In [21]:
#Let's create a function to change the data type.
def change_age(age):
    if age == None:
        return None
    elif re.search('years old', age) is not None:
        num = re.sub('[a-zA-Z ]', '', age)
        return int(num)
    else:
        year = int(age)
        age_2018 = 2018 - year
        return int(age_2018)

In [22]:
#Now, let's apply the function to the column 'age'.
df_merged['age'] = df_merged['age'].apply(change_age)
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2208 entries, 0 to 2207
Data columns (total 14 columns):
Unnamed: 0             2208 non-null int64
worthChange            2208 non-null object
realTimePosition       2208 non-null int64
lastName               2208 non-null object
age                    2143 non-null float64
gender                 2195 non-null object
country                2208 non-null object
image                  2208 non-null object
id                     2208 non-null int64
name                   2208 non-null object
position               2208 non-null float64
Company Sector         2208 non-null object
Company Name           2208 non-null object
worth_amount (BUSD)    2208 non-null float64
dtypes: float64(3), int64(3), object(8)
memory usage: 258.8+ KB